.docgen/examples/simple.json

{
  "envelope": "<?xml version=\"1.0\"?>\n<soap:Envelope xmlns:soap=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:web=\"http://www.oorsprong.org/websamples.countryinfo\"><soap:Header/><soap:Body><web:ListOfCountryNamesByName/></soap:Body></soap:Envelope>",
  "soapAction": "urn:MyAction",
  "charset": "UTF-8",
  "preserveQueryParams": true,
  "stripPath": false
}